function checkProbabilityTheory(count) {
    let even = 0;
    let odd = 0;
    let min = 100;
    let max = 1000;

    for (let i = 0; i < count; i++) {
        let rnd = Math.random() * (max - min) + min;
        rnd = Math.floor(rnd);
        if (rnd % 2 === 0) {
            even++;
        } else {
            odd++;
        }
    }

    let evenPercent = (even / count) * 100;
    let oddPercent = (odd / count) * 100;

    console.log(`Парних чисел: ${even}, Непарних чисел: ${odd}`);
    console.log(`Відсоток парних чисел: ${evenPercent.toFixed(2)}%`);
    console.log(`Відсоток непарних чисел: ${oddPercent.toFixed(2)}%`);
}

checkProbabilityTheory(10000);

/* Опис ДЗ: Перевірка теорії ймовірності. Напишіть функцію яка буде генерувати певну кількість випадкових чисел в діапазоні від 100 до 1000 включно. 
Порахувати кількість парних та непарних серед них. Обчислити відсоткове співвідношення - чи буде воно близьке до 50%50? 
Приклад функції checkProbabilityTheory(count). Парметр count буде вказувати скільки разів буде генеруватися випадкове число.

Умови виконання ДЗ

Функція виводить інформацію
Кількість згенерованих чисел: кількість чисел
Парних чисел: кількість парних чисел
Не парних чисел: кількість не парних чисел
Відсоток парних до не парних:
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки 
*/