function pow(x, y) {
    if (typeof x !== 'number' || typeof y !== 'number' || isNaN(x) || isNaN(y)) {
        return 'Введіть дійсні числа.';
    }

    let result = 1;
    for (let i = 0; i < y; i++) {
        result *= x;
    }
    console.log('Число', x, 'в степені', y, '=', result);
}


pow(2, 3)


/* Опис ДЗ: Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8.

Умови виконання ДЗ

Не використовувати **
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки
*/
